In [1]:
'''Comaprision Operator on DataFrame'''
import numpy as np
import pandas as pd
from numpy.random import randn

np.random.seed(101) # for generate diffrent random number

In [2]:
df_02 = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['01','02','03','04'])
print(df_02)

         01        02        03        04
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [3]:
# Comparision

bool_df = df_02 > 0  # give boolean
print(bool_df) # it will give T or F

# for get the original data with T or F
df_02[bool_df]

      01     02     03     04
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

         01        02        03        04
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [4]:
# for check comparision on particular row / column
df_02['01'] > 0

A     True
B     True
C    False
D     True
E     True
Name: 01, dtype: bool

In [5]:
'''boolean result for the data frame values'''
grtr_value = df_02 > 0
print(grtr_value)

'''if we want original value on the place of boolean then we can do this'''

df_02[grtr_value]

      01     02     03     04
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

         01        02        03        04
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [6]:
'''so if you directly apply this method then it will give you result in this form'''
df_02[df_02>1]

        01        02        03  04
A  2.70685       NaN       NaN NaN
B      NaN       NaN       NaN NaN
C      NaN       NaN       NaN NaN
D      NaN       NaN       NaN NaN
E      NaN  1.978757  2.605967 NaN

In [7]:
'''
so here in this example you will see it will return only those row which have value greater then
0 it will not return those row which have value less then 0'''
df_02[df_02['01']  > 0 ]

         01        02        03        04
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [8]:
df_02

         01        02        03        04
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [9]:
df_02[df_02['02']<0]

         01        02        03        04
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [10]:
'''Now suppose if you want to create a dataframe on the basis of selected row and column according to our choice then we can do it in this way'''

new_df = df_02[df_02['04'] >0]
'''here new_df a new dataframe on the basis of selected  row and column according to our condition'''
print(new_df)
new_df['01'] # here we can extract a column via new df.

         01        02        03        04
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

A    2.706850
B    0.651118
D    0.188695
E    0.190794
Name: 01, dtype: float64

In [11]:
'''Now we can do the upper thing in short form in this way'''
df_02[df_02['01']>1]['01'] # to  show only one column

A    2.70685
Name: 01, dtype: float64

In [12]:
df_02[df_02['01']>0][['01','02']]

         01        02
A  2.706850  0.628133
B  0.651118 -0.319318
D  0.188695 -0.758872
E  0.190794  1.978757

In [13]:
'''for multiple condition'''
df_02

         01        02        03        04
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [14]:
df_02[(df_02['01']>0) | (df_02['04']<0)]

         01        02        03        04
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [15]:
# for a reset a index or a normal index we can do this function
'''so via this function we can change the index to numeric index but if you again print df_02
then it will come in with normal or previous dataframe'''
df_02.reset_index()

  index        01        02        03        04
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [16]:
df_02

         01        02        03        04
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [17]:
'''for change index permanently to numeric we have to use inplace = true'''
df_02.reset_index(inplace=True)

In [18]:
df_02

  index        01        02        03        04
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [19]:
# add new column for index
new_index = 'IN NE LV BN CG'.split()
new_index

['IN', 'NE', 'LV', 'BN', 'CG']

In [20]:
df_02['state'] =  new_index 
df_02

  index        01        02        03        04 state
0     A  2.706850  0.628133  0.907969  0.503826    IN
1     B  0.651118 -0.319318 -0.848077  0.605965    NE
2     C -2.018168  0.740122  0.528813 -0.589001    LV
3     D  0.188695 -0.758872 -0.933237  0.955057    BN
4     E  0.190794  1.978757  2.605967  0.683509    CG

In [21]:
# set state as index
df_02.set_index('state')

      index        01        02        03        04
state
IN        A  2.706850  0.628133  0.907969  0.503826
NE        B  0.651118 -0.319318 -0.848077  0.605965
LV        C -2.018168  0.740122  0.528813 -0.589001
BN        D  0.188695 -0.758872 -0.933237  0.955057
CG        E  0.190794  1.978757  2.605967  0.683509